app/Controllers/Admin.php

SELECT *
FROM `posting`
---
public function index()
{
$idPosting = $this->postingModel->findAll();