app/Controllers/Home.php

    public function index()
    {
        $idPosting = $this->postingModel->findAll();
---
SELECT *
FROM `posting`