app/Models/LoginModel.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
---
    public function cekLogin($username, $password)
{
    return $this->db->table('user')->where(
        array(
            'username' => $username,
            'password' => $password
        )
    )->get()->getRowArray();