app/Models/PostingModel.php

INSERT INTO `posting` (`idPosting`, `judul`, `deskripsi`, `link`, `gambar`) VALUES ('POS002', 'Keyboard', 'Keyboard adalah sebuah perangkat keras (hardware) pada komputer yang berfungsi sebagai alat untuk input data yang berupa huruf, angka dan simbol.', 'https://www.logitech.com/id-id/products/keyboards/k120-usb-standard-computer.html', 'keyboard.jpg')
---
    public function savePosting($data)
{

    $query = $this->db->table($this->table)->insert($data);

UPDATE `posting` SET `judul` = 'Komputer', `deskripsi` = 'komputer adalah alat yang dipakai untuk mengolah data menurut prosedur yang telah dirumuskan. komputer adalah suatu perangkat keras yang sangat berkaitan dengan teknologi. komputer mampu membantu berbagai pekerjaan manusia', `link` = 'https://g.co/kgs/QPFUZp', `gambar` = 'Komputer.jpg'
WHERE `idPosting` = 'POS001'
---
    public function updatePosting($data, $id)
{
    $query = $this->db->table($this->table)->update($data,
    array('idPosting' => $id));